02_OpenFOAM_FVM/cases/Ejercicio5/planarCouette_HighRe/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Re = 5e5 + 7*5000 = 535000 (ultima cifra DNI = 7)
// U = 10 m/s, H = 0.1 m
// nu = U*H/Re = 10*0.1/535000 = 1.869e-6 m2/s

viscosityModel  constant;

nu              1.869e-06;

// ************************************************************************* //
