02_OpenFOAM_FVM/cases/Ejercicio5/planarCouette_HighRe/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       49450;
    }
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       49500;
    }
    cyc_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          500;
        startFace       49550;
        matchTolerance  0.0001;
        neighbourPatch  cyc_half1;
        transformType   translational;
        separation      (-0.1 -5.551115123125783e-18 0);
    }
    cyc_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          500;
        startFace       50050;
        matchTolerance  0.0001;
        neighbourPatch  cyc_half0;
        transformType   translational;
        separation      (0.1 5.551115123125783e-18 0);
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          50000;
        startFace       50550;
    }
)

// ************************************************************************* //
