02_OpenFOAM_FVM/cases/Ejercicio5/planarCouette_HighRe/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);


blocks
(
    // High-Reynolds: Malla mas gruesa para wall functions (y+ ~ 30-300)
    hex (0 1 2 3 4 5 6 7) (20 50 1)
    simpleGrading
    (
        1
        (
            (0.5 0.5 1)    // Primera mitad uniforme
            (0.5 0.5 1)    // Segunda mitad uniforme
        )
        1
    )
);


boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    cyc_half0
    {
        type cyclic;
        neighbourPatch cyc_half1;
        faces
        (
            (0 4 7 3)
        );
    }
    cyc_half1
    {
        type cyclic;
        neighbourPatch cyc_half0;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
